______________
Layer (type)                         Output Shape              Param #       Connected to
===================================================================================================================
input_rpn_feature_map (InputLayer)   (None, None, None, 256)   0
___________________________________________________________________________________________________________________
rpn_conv_shared (Conv2D)             (None, None, None, 512)   1180160       input_rpn_feature_map[0][0]
___________________________________________________________________________________________________________________
rpn_class_raw (Conv2D)               (None, None, None, 6)     3078          rpn_conv_shared[0][0]
___________________________________________________________________________________________________________________
lambda_1 (Lambda)                    (None, None, 2)           0             rpn_class_raw[0][0]
___________________________________________________________________________________________________________________
rpn_bbox_pred (Conv2D)               (None, None, None, 12)    6156          rpn_conv_shared[0][0]
___________________________________________________________________________________________________________________
rpn_class_xxx (Activation)           (None, None, 2)           0             lambda_1[0][0]
___________________________________________________________________________________________________________________
lambda_2 (Lambda)                    (None, None, 4)           0             rpn_bbox_pred[0][0]
===================================================================================================================
Total params: 1,189,394
Trainable params: 1,189,394
Non-trainable params: 0
___________________________________________________________________________________________________________________
